# Campanha de marketing de um banco

http://archive.ics.uci.edu/ml/datasets/Bank+Marketing

https://www.kaggle.com/janiobachmann/bank-marketing-dataset

# Aula 1

In [ ]:
url = 'https://raw.githubusercontent.com/allanspadini/classificacao-banco/main/bank.csv'

In [ ]:
import pandas as pd

In [ ]:
df_banco = pd.read_csv(url)
df_banco.head()

   age         job  marital  education  ... pdays  previous poutcome deposit
0   59      admin.  married  secondary  ...    -1         0  unknown     yes
1   56      admin.  married  secondary  ...    -1         0  unknown     yes
2   41  technician  married  secondary  ...    -1         0  unknown     yes
3   55    services  married  secondary  ...    -1         0  unknown     yes
4   54      admin.  married   tertiary  ...    -1         0  unknown     yes

[5 rows x 17 columns]